tap "homebrew/bundle"
tap "homebrew/services"
brew "xz"
brew "direnv"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghq"
brew "mysql@8.0", restart_service: true
brew "ocaml"
brew "opam"
brew "pipx"
brew "ruby"
brew "sheldon"
brew "starship"
brew "tfenv"
brew "tmux"
cask "font-fira-code-nerd-font"
cask "mactex-no-gui"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "chrisdias.vscode-opennewinstance"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dprint.dprint"
vscode "eamodio.gitlens"
vscode "flowtype.flow-for-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.vscode-pull-request-github"
vscode "huytd.tokyo-city"
vscode "ics.japanese-proofreading"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.vscode-typescript-next"
vscode "pkief.material-icon-theme"
vscode "rbuckton.tsserver-live-reload"
vscode "redhat.java"
vscode "ryu1kn.partial-diff"
vscode "sgryjp.japanese-word-handler"
vscode "sleistner.vscode-fileutils"
vscode "streetsidesoftware.code-spell-checker"
vscode "suhay.vscode-editor-group-minimizer"
vscode "tintinweb.vscode-decompiler"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudioexptteam.vscodeintellicode-completions"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "yrm.type-challenges"
